Zrn-code/2023-nxp-hackthon/LCD_UI/sdk/Core/board/pin_mux.h
/* GPIO_EMC_16 (coord A5), SEMC_A7/U6[H2] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_A7_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_A7_SIGNAL                                   ADDR   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_A7_CHANNEL                                    7U   /*!< Signal channel */

/* GPIO_EMC_17 (coord A4), SEMC_A8/U16[H1] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_A8_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_A8_SIGNAL                                   ADDR   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_A8_CHANNEL                                    8U   /*!< Signal channel */

/* GPIO_EMC_18 (coord B2), SEMC_A9/U16[G3] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_A9_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_A9_SIGNAL                                   ADDR   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_A9_CHANNEL                                    9U   /*!< Signal channel */

/* GPIO_EMC_23 (coord G2), SEMC_A10/U16[H9] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_A10_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_A10_SIGNAL                                  ADDR   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_A10_CHANNEL                                  10U   /*!< Signal channel */

/* GPIO_EMC_19 (coord B4), SEMC_A11/U6[G2] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_A11_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_A11_SIGNAL                                  ADDR   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_A11_CHANNEL                                  11U   /*!< Signal channel */

/* GPIO_EMC_20 (coord A3), SEMC_A12/U16[G1] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_A12_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_A12_SIGNAL                                  ADDR   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_A12_CHANNEL                                  12U   /*!< Signal channel */

/* GPIO_EMC_21 (coord C1), SEMC_BA0/U16[G7] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_BA0_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_BA0_SIGNAL                                    BA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_BA0_CHANNEL                                   0U   /*!< Signal channel */

/* GPIO_EMC_22 (coord F1), SEMC_BA1/U16[G8] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_BA1_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_BA1_SIGNAL                                    BA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_BA1_CHANNEL                                   1U   /*!< Signal channel */

/* GPIO_EMC_24 (coord D3), SEMC_CAS/U16[F7] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_CAS_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_CAS_SIGNAL                              semc_cas   /*!< Signal name */

/* GPIO_EMC_27 (coord A2), SEMC_CKE/U16[F3] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_CKE_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_CKE_SIGNAL                              semc_cke   /*!< Signal name */

/* GPIO_EMC_26 (coord B3), SEMC_CLK/U16[F2] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_CLK_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_CLK_SIGNAL                              semc_clk   /*!< Signal name */

/* GPIO_EMC_29 (coord E1), SEMC_CS0/U16[G9] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_CS0_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_CS0_SIGNAL                                    CS   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_CS0_CHANNEL                                   0U   /*!< Signal channel */

/* GPIO_EMC_00 (coord E3), SEMC_D0/U16[A8] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D0_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D0_SIGNAL                                   DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D0_CHANNEL                                    0U   /*!< Signal channel */

/* GPIO_EMC_01 (coord F3), SEMC_D1/U16[B9] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D1_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D1_SIGNAL                                   DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D1_CHANNEL                                    1U   /*!< Signal channel */

/* GPIO_EMC_02 (coord F4), SEMC_D2/U16[B8] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D2_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D2_SIGNAL                                   DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D2_CHANNEL                                    2U   /*!< Signal channel */

/* GPIO_EMC_03 (coord G4), SEMC_D3/U16[C9] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D3_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D3_SIGNAL                                   DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D3_CHANNEL                                    3U   /*!< Signal channel */

/* GPIO_EMC_04 (coord F2), SEMC_D4/U16[C8] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D4_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D4_SIGNAL                                   DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D4_CHANNEL                                    4U   /*!< Signal channel */

/* GPIO_EMC_05 (coord G5), SEMC_D5/U16[D9] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D5_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D5_SIGNAL                                   DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D5_CHANNEL                                    5U   /*!< Signal channel */

/* GPIO_EMC_06 (coord H5), SEMC_D6/U16[D8] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D6_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D6_SIGNAL                                   DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D6_CHANNEL                                    6U   /*!< Signal channel */

/* GPIO_EMC_07 (coord H4), SEMC_D7/U16[E9] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D7_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D7_SIGNAL                                   DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D7_CHANNEL                                    7U   /*!< Signal channel */

/* GPIO_EMC_30 (coord C6), SEMC_D8/U16[E1] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D8_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D8_SIGNAL                                   DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D8_CHANNEL                                    8U   /*!< Signal channel */

/* GPIO_EMC_31 (coord C5), SEMC_D9/U16[D2] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D9_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D9_SIGNAL                                   DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D9_CHANNEL                                    9U   /*!< Signal channel */

