Zrn-code/2023-nxp-hackthon/LCD_UI/sdk/Core/board/pin_mux.h
/* GPIO_EMC_32 (coord D5), SEMC_D10/U16[D1] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D10_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D10_SIGNAL                                  DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D10_CHANNEL                                  10U   /*!< Signal channel */

/* GPIO_EMC_33 (coord C4), SEMC_D11/U16[C2] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D11_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D11_SIGNAL                                  DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D11_CHANNEL                                  11U   /*!< Signal channel */

/* GPIO_EMC_34 (coord D4), SEMC_D12/U16[C1] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D12_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D12_SIGNAL                                  DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D12_CHANNEL                                  12U   /*!< Signal channel */

/* GPIO_EMC_35 (coord E5), SEMC_D13/U16[B2] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D13_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D13_SIGNAL                                  DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D13_CHANNEL                                  13U   /*!< Signal channel */

/* GPIO_EMC_36 (coord C3), SEMC_D14/U16[B1] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D14_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D14_SIGNAL                                  DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D14_CHANNEL                                  14U   /*!< Signal channel */

/* GPIO_EMC_37 (coord E4), SEMC_D15/U16[A2] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D15_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D15_SIGNAL                                  DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D15_CHANNEL                                  15U   /*!< Signal channel */

/* GPIO_EMC_08 (coord H3), SEMC_DM0/U16[E8] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_DM0_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_DM0_SIGNAL                                    DM   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_DM0_CHANNEL                                   0U   /*!< Signal channel */

/* GPIO_EMC_38 (coord D6), SEMC_DM1/U16[F1] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_DM1_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_DM1_SIGNAL                                    DM   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_DM1_CHANNEL                                   1U   /*!< Signal channel */

/* GPIO_EMC_25 (coord D2), SEMC_RAS/U16[F8] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_RAS_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_RAS_SIGNAL                              semc_ras   /*!< Signal name */

/* GPIO_EMC_28 (coord D1), SEMC_WE/U16[F9] */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_WE_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_WE_SIGNAL                                semc_we   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSemcPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2C1Pins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
